% Ερώτημα 1
X = rand(4, 3, 2); % Δημιουργία τυχαίου 4x3x2 τανυστή X 
disp('Αρχικός τανυστής X:');
disp(X);

N = 1; % Επιλογή της διάστασης N ως προς την οποία θα γίνει ο πολλαπλασιασμός
disp(['Επιλεγμένη διάσταση N για τροπικό πολλαπλασιασμό: ', num2str(N)]);

[K, L, M] = size(X);
V = rand(K, 1); % Δημιουργία ενός τυχαίου διανύσματος V διάστασης {4,3,2}x1
disp('Διάνυσμα V:');
disp(V);

Y = ttv_1084661(X, V, N); % Κλήση της συνάρτησης ttv_1084661 για τροπικό πολλαπλασιασμό
disp('Τελικός τανυστής Υ:');
disp(Y);

B = ttv(tensor(X), V, N);
disp(B);

% Ερώτημα 2
A = rand(2,3,4); % Ορισμός τυχαίου 2x3x4 τανυστή Α
disp(A);
B = rand(2,3,4); % Ορισμός τυχαίου 2x3x4 τανυστή Β
disp(B);

C = ttt_1084661(A, B); 
disp('Εξωτερικό γινόμενο των τανυστών Α, Β:');
disp(C);

D = ttt(tensor(A), tensor(B));
disp(D);

t = ttt_1084661(A, B, 'all');
disp('Εσωτερικό γινόμενο των τανυστών Α, Β:');
disp(num2str(t));

% Κλήση της συνάρτησης test_tensor
%test_tensor_1084661;


