% Δημιουργία τυχαίου τρισδιάστατου πίνακα X
X = rand(3, 4, 2);

% Δημιουργία ενός τυχαίου διανύσματος V
V = rand(4, 1);

% Επιλογή της διάστασης N (στο παράδειγμα, θα επιλέξουμε τη δεύτερη διάσταση)
N = 2;

% Κλήση της συνάρτησης ttv_myid
Y = ttv_myid_1084661(X, V, N);

% Εμφάνιση αποτελεσμάτων
disp('Αρχικός πίνακας X:');
disp(X);

disp('Διάνυσμα V:');
disp(V);

disp(['Επιλεγμένη διάσταση N: ', num2str(N)]);

disp('Αποτέλεσμα Y:');
disp(Y);

A = rand(2,3,4); % Ένα 2x3x4 MDA
B = rand(2,3,4); % Ένα 2x3x4 MDA

C = ttt_myid_1084661(A, B); 
disp('Εξωτερικό γινόμενο των τανυστών Α, Β');
disp(num2str(C));

t = ttt_myid_1084661(A, B, 'all');
disp('Εσωτερικό γινόμενο των τανυστών Α, Β');
disp(num2str(t));

% Κλήση της συνάρτησης test_tensor
test_tensor_1084661;

